src/DataProcessors/ОбработкаЗапросаКоммерческогоПредложения/ОбработкаЗапросаКоммерческогоПредложения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ОбработкаЗапросаКоммерческогоПредложения</name>
</mdclass:DataProcessor>

src/Enums/ВидыКонтрактов/ВидыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыКонтрактов</name>
  <enumValues>
    <name>КонтрактСЗаказчиком</name>
  </enumValues>
  <enumValues>
    <name>КонтрактСПоставщиком</name>
  </enumValues>
</mdclass:Enum>

src/Enums/ТипыКонтрактов/ТипыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыКонтрактов</name>
  <enumValues>
    <name>Контракт</name>
  </enumValues>
  <enumValues>
    <name>Договор</name>
  </enumValues>
  <enumValues>
    <name>КоммерческоеПредложение</name>
  </enumValues>
  <enumValues>
    <name>ТКП</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыКонтрактов/СтатусыКонтрактов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыКонтрактов</name>
  <enumValues>
    <name>Активен</name>
  </enumValues>
  <enumValues>
    <name>Неактивен</name>
  </enumValues>
</mdclass:Enum>

src/Documents/Контракт/Контракт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Контракт</name>
  <comment>Контракты, договоры, коммерческие предложения</comment>
  <registerRecords>InformationRegister.КонтрактыСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныПредметовСнабжения</registerRecords>
  <registerRecords>InformationRegister.ТКПСЗаказчикомПоЗаявкам</registerRecords>
  <registerRecords>InformationRegister.ЦеныДЗО</registerRecords>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.ИностранныеЗаказчики</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.ОКВ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаТоргов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыКонтрактов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействияКП</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаключенияКонтракта</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственноеЛицо</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерКонтракта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПредметыСнабжения</name>
    <attributes>
      <name>UID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабжения</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>8</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.Заявка</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторПозиции</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозиции</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокПоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаТекущегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСледующегоГода</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаГодаЧерез1</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>14</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИсточникЦеновойИнформации</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеЦенообразования</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредметСнабженияИсходный</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/КаталогПредметовСнабжения/КаталогПредметовСнабжения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КаталогПредметовСнабжения</name>
  <attributes>
    <name>НомерОСК</name>
    <comment>Номер в каталоге ОСК</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>18</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Обозначение</name>
    <comment>№ чертежа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбозначениеТранслитированное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УтвержденноеНаименование</name>
    <comment>Утвержденное наименование на русском</comment>
    <type>
      <types>CatalogRef.УтвержденныеНаименованияПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>СамостоятельнаяПоставка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументНаПоставку</name>
    <comment>ТУ, ГОСТ</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипДокумента</name>
    <type>
      <types>CatalogRef.ТипДокументацииДляИзготовленияИПоставкиПредметовСнабжения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ОКЕИ</types>
    </type>
  </attributes>
  <attributes>
    <name>NSN</name>
    <comment>Номер по системе кодификации НАТО</comment>
    <type>
      <types>String</types>
      <types>CatalogRef.ПредметыСнабженияНАТО</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕКПС</name>
    <type>
      <types>CatalogRef.ЕКПС</types>
    </type>
  </attributes>
  <attributes>
    <name>INCAT</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>32</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурныйНомерВМФ</name>
    <comment>Номер по базе Юпитер-СТО</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОКПД2</name>
    <type>
      <types>CatalogRef.ОКПД2</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.ТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПрошивки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрошивки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусыЗаписейСправочниковИКаталогов</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодСнятияСПроизводства</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПравилаУпаковкиТранспортировкиХранения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоСтруктуре</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Шифр</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФНН</name>
    <comment>Федеральный номенклатурный номер</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>13</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШифрТранслитированный</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИзготовителиИПоставщики</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Поставщик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Разработчик</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изготовитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокиИзготовления</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>СостояниеПроизводства</name>
      <type>
        <types>CatalogRef.СостоянияПроизводстваПС</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Аналоги</name>
    <attributes>
      <name>Аналог</name>
      <type>
        <types>CatalogRef.КаталогПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипЗамены</name>
      <type>
        <types>CatalogRef.ТипыЗаменыПредметаСнабженияАналогом</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Характеристики</name>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиПредметовСнабжения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>5</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ОКЕИ</types>
      </type>
    </attributes>
    <attributes>
      <name>Основная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеДляЗаказчика</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДанныеИзКСУНСИ</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/DataProcessors/ОбработкаЗапросаКоммерческогоПредложения/Forms/Форма/Module.bsl
////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Заявка", Заявка) Тогда
		
		Элементы.Заявка.ТолькоПросмотр = Истина;
		
	КонецЕсли;

КонецПроцедуры //ПриСозданииНаСервере

////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
Процедура Загрузить(Команда)
	
	Если ПустаяСтрока(ПутьКФайлу) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru = 'Для запуска обработки необходимо предварительно выбрать файл Microsoft Excel.'"), , "ПутьКФайлу");
		Возврат;
		
	КонецЕсли; 
	
	ПолучитьТаблицу();
	СформироватьТабличнуюЧастьПредметыСнабженияНаСервере();
	
КонецПроцедуры //Загрузить

&НаКлиенте
Процедура СоздатьКоммерческоеПредложение(Команда)
	
	Ошибки = Неопределено;
	Отказ = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Заявка) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "Заявка", НСтр("ru = 'Для создания документа необходимо выбрать заявку.'"), Неопределено);
				
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ЗапросНаКоммерческоеПредложение) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ЗапросНаКоммерческоеПредложение", НСтр("ru = 'Для создания документа необходимо выбрать запрос на коммерческое предложение.'"), Неопределено);
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(НомерКП) Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "НомерКП", НСтр("ru = 'Для создания документа необходимо указать номер коммерческого предложения.'"), Неопределено);
		
	КонецЕсли;
			
	Если ТаблицаПредметыСнабжения.Количество() = 0 Тогда
		
		ОбщегоНазначенияКлиентСервер.ДобавитьОшибкуПользователю(Ошибки, "ТаблицаПредметыСнабжения", НСтр("ru = 'Нет данных для загрузки.'"), Неопределено);
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.СообщитьОшибкиПользователю(Ошибки, Отказ);
	
	Если Не Отказ Тогда
		
		СформироватьДокументКонтракт();

	КонецЕсли;
	
КонецПроцедуры // СоздатьКоммерческоеПредложение

////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

&НаКлиенте
Процедура ПутьКФайлуНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Фильтр = "Excel (*.xlsx;*.xls)|*.xlsx;*.xls";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
		
		ПутьКФайлу = ДиалогОткрытияФайла.ВыбранныеФайлы[0];
				
	КонецЕсли;

КонецПроцедуры //ПутьКФайлуНачалоВыбора

&НаКлиенте
Процедура ПолучитьТаблицу()
	
	ТаблицаПредметыСнабжения.Очистить();
	
	Попытка
		
		Состояние("Загрузка Microsoft Excel...");
		ExcelПриложение = Новый COMОбъект("Excel.Application");
		
	Исключение
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при загрузке Microsoft Excel: %1'"), ОписаниеОшибки()); 				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	КонецПопытки;
	
	Попытка
		
		Состояние("Открытие файла Microsoft Excel...");
		ExcelФайл = ExcelПриложение.WorkBooks.Open(ПутьКФайлу);
		
		Состояние("Обработка файла Microsoft Excel...");
		ExcelЛист = ExcelФайл.Sheets(1);
		xlCellTypeLastCell = 11;
		ExcelПоследняяСтрока = ExcelЛист.Cells.SpecialCells(xlCellTypeLastCell).Row;
				
		Для Строка = 3 По ExcelПоследняяСтрока Цикл
			Состояние("Обработка файла Microsoft Excel : " + "строка " + Строка + " из " + ExcelПоследняяСтрока);
			
			ПредметСнабжения = 			ExcelЛист.Cells(Строка, 3).Value;
			Если НЕ ЗначениеЗаполнено(ПредметСнабжения) Тогда
				Продолжить;
			КонецЕсли;
			
			
			НоваяСтрока = ТаблицаПредметыСнабжения.Добавить();
			
			НоваяСтрока.Идентификатор 		= ExcelЛист.Cells(Строка, 1).Value;
			НоваяСтрока.Входимость			= ExcelЛист.Cells(Строка, 2).Value;
			НоваяСтрока.ПредметСнабжения 	= ExcelЛист.Cells(Строка, 3).Value;
			НоваяСтрока.ЕдиницаИзмерения 	= ExcelЛист.Cells(Строка, 5).Value;
			НоваяСтрока.ОбозначениеТУ	 	= ExcelЛист.Cells(Строка, 7).Value;
			
			НоваяСтрока.Количество	 		= СтрЗаменить(ExcelЛист.Cells(Строка, 6).Value, Символы.НПП,"");
			НоваяСтрока.СрокИзготовления   	= СтрЗаменить(ExcelЛист.Cells(Строка, 9).Value, Символы.НПП,"");
			НоваяСтрока.Цена   				= СтрЗаменить(ExcelЛист.Cells(Строка, 10).Value, Символы.НПП,"");
						
		КонецЦикла;
		
		
		ExcelФайл.Close();
		
	Исключение
		
		ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Ошибка при открытии/чтении файла  %1: %2'"), ПутьКФайлу, ОписаниеОшибки()); 				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);

	КонецПопытки;
	
	Состояние("Загрузка в БД...");
	
КонецПроцедуры //ПолучитьТаблицу 

&НаСервере
Процедура СформироватьДокументКонтракт()
	
	ДокументКонтрактОбъект = Документы.Контракт.СоздатьДокумент();
	ДокументКонтрактОбъект.Дата 				= ТекущаяДата();
	ДокументКонтрактОбъект.НомерКонтракта		= НомерКП;
	ДокументКонтрактОбъект.Вид 					= Перечисления.ВидыКонтрактов.КонтрактСПоставщиком;
	ДокументКонтрактОбъект.Тип 					= Перечисления.ТипыКонтрактов.КоммерческоеПредложение;
	ДокументКонтрактОбъект.Контрагент 			= ЗапросНаКоммерческоеПредложение.Поставщик;
	ДокументКонтрактОбъект.Валюта 				= ЗапросНаКоммерческоеПредложение.Валюта;
	ДокументКонтрактОбъект.Статус 				= Перечисления.СтатусыКонтрактов.Активен;
	ДокументКонтрактОбъект.ОтветственноеЛицо 	= Пользователи.ТекущийПользователь();
	
	Для Каждого СтрокаТЗПредметыСнабжения Из ТЗПредметыСнабжения Цикл
		
		НоваяСтрока = ДокументКонтрактОбъект.ПредметыСнабжения.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗПредметыСнабжения);
		
		Если ЗначениеЗаполнено(НоваяСтрока.ПредметСнабжения) Тогда
			НоваяСтрока.ПредметСнабженияИсходный = НоваяСтрока.ПредметСнабжения;
		КонецЕсли;
		
		НоваяСтрока.СрокПоставки = СтрокаТЗПредметыСнабжения.СрокИзготовления;//?
		НоваяСтрока.Заявка 		 = Заявка;
		НайденныеСтроки 		 = Заявка.Спецификация.НайтиСтроки(Новый Структура("ПредметСнабжения, ЕдиницаИзмерения", НоваяСтрока.ПредметСнабжения, НоваяСтрока.ЕдиницаИзмерения)); 
		Если НайденныеСтроки.Количество() > 0 Тогда
			
			НоваяСтрока.ИдентификаторПозиции = НайденныеСтроки[0].ИдентификаторПозиции;
			
		КонецЕсли;

	КонецЦикла;
	
	Попытка 
		
		ДокументКонтрактОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Документ Коммерческое предложение №%1 от %2 успешно записан'"), СокрЛП(ДокументКонтрактОбъект.Номер), ДокументКонтрактОбъект.Дата); 				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения); 
		
		КоммерческоеПредложение = ДокументКонтрактОбъект.Ссылка;
		Элементы.СоздатьКоммерческоеПредложение.Доступность = Ложь;
		
	Исключение
		
		ТекстОшибки = НСтр("ru = 'Не удалось записать документ коммерческого предложения!'"); 				
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		
	КонецПопытки;   

КонецПроцедуры //СформироватьДокументКонтракт

&НаСервере
Процедура СформироватьТабличнуюЧастьПредметыСнабженияНаСервере()
	
	ТЗ = РеквизитФормыВЗначение("ТЗПредметыСнабжения");
	ТЗ.Очистить();
	
	Для Каждого СтрокаТЗ Из ТаблицаПредметыСнабжения Цикл
		
		НоваяСтрока = ТЗ.Добавить();
		НоваяСтрока.НомерСтроки = ТЗ.Количество();
		НоваяСтрока.ПредметСнабжения = Справочники.КаталогПредметовСнабжения.НайтиПоРеквизиту("UID", СтрокаТЗ.Идентификатор);
		НоваяСтрока.ЕдиницаИзмерения = Справочники.ОКЕИ.НайтиПоНаименованию(СтрокаТЗ.ЕдиницаИзмерения);
		НоваяСтрока.Количество = СтрокаТЗ.Количество;
		НоваяСтрока.Цена = СтрокаТЗ.Цена;
		НоваяСтрока.СрокИзготовления = СтрокаТЗ.СрокИзготовления;
								
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ТЗ, "ТЗПредметыСнабжения");
	
КонецПроцедуры //СформироватьТабличнуюЧастьПредметыСнабженияНаСервере
